'use strict';
// Пример №1
// Создайте переменные a1, a2, a3, a4, a5. При помощи математических 
// операторов (сложение, вычитание и т.д.) найдите значения выражений:
// 7 + 2,
// 7 - 3,
// 2 * 4,
// 4 / 2,
// поместив результат каждого выражения в соответствующую 
// переменную. Например, let a1 = 7 + 2. Результаты переменных вывести в console.log();
let a1 = 7+2; // 9
let a2 = 7-3;// 4
let a3 = 2*4;// 8
let a4 = 4/2;// 2
console.log(a1);
console.log(a2);
console.log(a3);
console.log(a4);


// Пример №2
// Напишите скрипт, который находит площадь прямоугольника высота 23см. 
// (в числовую переменную height), шириной 10см (в числовую переменную width), 
// значение площади должно хранится в числовой переменной s. (S=a*b);
let height = 23;
let width = 10;
let s;
s = height * width;
console.log(`S = ${s}`);


// Пример №3
// Создайте переменную str и присвойте ей значение 'qwerty'. Обращаясь к отдельным 
// символам этой строки выведите на экран символ 'q', символ 'w', символ 'r'.
let str = 'qwerty';
console.log(str[0]);
console.log(str[1]);
console.log(str[3]);

// Пример №4
// Напишите скрипт, который считает количество секунд в часе.
console.log(60 * 60);

// Пример №5
// Переделайте приведенный код так, чтобы в нем использовались операции 
// +=, -=, *=, /=, ++, --. 
// Количество строк кода при этом не должно измениться. Код для переделки:
// let num = 1;
// num = num + 12;
// num = num - 14;
// num = num * 5;
// num = num / 7;
// num = num + 1;
// num = num - 1;
// console.log(num);
let num = 1;
num += 12;
num -= 14;
num *= 5;
num /= 7;
num ++;
num --; 
console.log(num);


// ДОМАШНЕЕ ЗАДАНИЕ

// Пример №1
// Создайте переменные b1, b2, b3, b4, b5. Поместите в них результат выражений:
// 5 % 3,
// 3 % 5,
// 5 + '3',
// '5' - 3,
// 75 + 'кг'
// Результаты переменных вывести в console.log();
let b1 = 5%3;
let b2 = 3%5;
let b3 = 5 + '3';
let b4 = '5' - 3;
let b5 = 75 + 'кг';
console.log(b1);
console.log(b2);
console.log(b3);
console.log(b4);
console.log(b5);

// Пример №2 
// Напиши скрипт, который находит объем цилиндра высотой 10м (переменная heightC) и 
// диаметром основания 4м (dC), результат поместите в переменную v.
let heightC = 10;
let dC = 4;
let v;
v = heightC * dC;
console.log(`V = ${v}`);


// Пример №3
// Создайте переменные a=10 и b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления).
    let a = 10;
    let b = 2;
    console.log(a + b);
    console.log(a - b);
    console.log(a * b);
    console.log(a / b);

// Пример №4
//  Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. 
//  Выведите на экран значение переменной result.
    let c = 15;
    let d = 2;
    let result = (c + d);
    console.log(result);

// Пример №5
//  Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.
    let a = 10;
    let b = 2;
    let c = 4;
    console.log(a + b + c);


// Пример №6
//  Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. 
//  Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат 
//  запишите в переменную result. Выведите на экран значение переменной result.

// Пример №7
// Создайте переменную name и присвойте ей ваше имя. Выведите на экран фразу 'Привет, (Имя)!'.
let name = 'Наталия';
console.log(`Привет, ${name}!`);

// Пример №8
// Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'Мне (Возраст) лет!'.
let age = 36;
console.log('Мне ' + age + ' лет' + '!');


// Пример №9
// Создайте переменную str и присвойте ей значение 'abcde'. Обращаясь к отдельным символам этой строки выведите 
// на экран символ 'a', символ 'c', символ 'e'.
let str = 'abcde';
console.log(str[0]);
console.log(str[2]);
console.log(str[4]);

//Пример №10
// Напишите скрипт, который считает количество секунд в часе, в сутках, в месяце.
    console.log(60 * 60);
    console.log(60 * 60 * 24);
    console.log(60 * 60 * 24 * 30);

//Пример №11
//Переделайте этот код так, чтобы в нем использовались операции +=, -=, *=, /=. 
// Количество строк кода при этом не должно измениться.
// let num = 47;
// num = num + 7;
// num = num - 18;
// num = num * 10;
// num = num / 15;
// console.log(num);
    let num = 47;
    num += 7;
    num -= 18;
    num *= 10;
    num /= 15;
    console.log(num);

// Пример №12
// Переделайте этот код так, чтобы в нем использовались операции ++ и --. 
// Количество строк кода при этом не должно измениться.
// let num = 10;
// num = num + 1;
// num = num + 1;
// num = num - 1;
// console.log(num);
    let num = 10;
    num ++;
    num ++;
    nim --;
    console.log(num);




    // Домашнее задание
// Условия
// Пример 1
// В переменной minute лежит число от 0 до 59. 
// Определите в какую четверть часа попадает это число 
// (в первую, вторую, третью или четвертую).
let minute = 59; 
if (minute > 0 && minute <=14) {
console.log(‘1 quarter’);
} else if (minute > 14 && minute <=29) {
console.log(‘2 quarter’); 
} else if (minute > 29 && minute <=44) {
console.log(‘3 quarter’);
} else if (minute > 44 && minute <= 59) {
console.log(‘4 quarter’); }




// Пример 2
// Переменная lang может принимать 2 значения: 'ru' 'en'. 
// Если она имеет значение 'ru', то в переменную arr 
// запишем массив дней недели на русском языке, 
// а если имеет значение 'en' – то на английском. 
// для ru - arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс']
// для en - arr = ['mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn'];

let lang;
let arr;
if (lang === ‘ru’) {
arr = 'пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс';
}
else if (lang === ‘en’) {
arr = 'mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn';
}
console.log(arr);



// Пример 3 
// Напишите код, который предлагает пользователю ввести целое 
// число. Нужно вывести на экран сколько в этом числе цифр, 
// а также положительное оно или отрицательное. Например, 
// "Число " + num + " однозначное положительное". 
// Достаточно будет определить, является ли число однозначным, 
// двузначным или трехзначным и более.

let num;




// Пример 4
// Создаются переменные red и yellow для красного и 
// жёлтого сигналов светофора соответственно.
// В том случае, если переменным red или yellow присвоены 
// значения "нет", горит зелёный сигнал светофора и 
// выводиться сообщение, разрешающее переходить дорогу.
let red;
let yellow;
if (red === ‘нет’) {
console.log(‘go!’)
}
else if (yellow === ‘нет’) {
console.log(‘go!’)
}




// Циклы
// Пример 5
// Выведите столбец чисел от 1 до 12.
let i = 1;
while (i <= 12) {
console.log(i);
i++;
}


// Пример 6
// Выведите столбец чисел от 5 до 13.
let i = 5;
while (i <= 13) {
console.log(i);
i++;
}


// Пример 7
// Выведите столбец четн. bых чисел в промежутке от 0 до 16.
for (let i = 0; i <= 16; i++) {
if (i % 2 === 0) {
console.log(i);
}
}

// Пример 8 
// С помощью цикла найдите сумму чисел arr = [2,5,8,3,6]
let result  = 0;
let arr = [2,5,8,3,6];
for (let i = 0; i < arr.length; i++) {
 result = result + arr[i];
} console.log(result);







